# SetUnobscuredInView Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarInSystem..::..SetUnobscuredInView Method
RebarInSystem Class See Also
---
Sets RebarInSystem element to be shown unobscured in a view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetUnobscuredInView(
	View view,
	bool unobscured
)
```

Visual Basic
---
```text
Public Sub SetUnobscuredInView ( _
	view As View, _
	unobscured As Boolean _
)
```

Visual C++
---
```text
public:
void SetUnobscuredInView(
	View^ view,
	bool unobscured
)
```

# ### Parameters
view
    Type: Autodesk.Revit.DB..::..View The view element
unobscured
    Type: System..::..Boolean True if RebarInSystem element is shown unobscured, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This element doesn't have valid visibility data. |

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace